Revit 2027 API
RebarShapeTerminationsData.GetDocument Method
 Gets the document containing the end treatment ids.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document GetDocument()
Public Function GetDocument As Document
public:
Document^ GetDocument()
member GetDocument : unit -> Document
Return Value
Document
 Returns the document containing the end treatment ids.
See Also
Reference
RebarShapeTerminationsData Class
Autodesk.Revit.DB.Structure Namespace